#ifndef __STC_NET_H__
#define __STC_NET_H__
// Using STC Library
#include "STC15Fxxxx.h"

//========================================================================
// 函数: void PrintString1(u8 *puts)
// 描述: 串口1发送字符串函数。
// 参数: puts:  字符串指针.
// 返回: none.
// 版本: VER1.0
// 日期: 2014-11-28
// 备注:
//========================================================================
void PrintString1(u8 *puts);

//========================================================================
// 函数: void   UART1_config(u8 brt)
// 描述: UART1初始化函数。
// 参数: brt: 选择波特率, 2: 使用Timer2做波特率, 其它值: 使用Timer1做波特率.
// 返回: none.
// 版本: VER1.0
// 日期: 2014-11-28
// 备注:
//========================================================================
void UART1_config();
//========================================================================
// 函数: void  delay_ms(u8 ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~65532ms. 自动适应主时钟.
// 返回: none.
// 备注:
//========================================================================
void delay_ms(u16 ms);

int StringLen(u8* String);

//=========================================================================
//函数：bool BuffCMP(u8* cmp)
//参数：比对缓冲区的字符串cmp
//返回：布尔值
bit BuffCMP(u8* cmp);

//===============================
//发送AT给wifi模块
bit ATConnect();

//==============================
//设置wifi模块的模式
bit ATMode();

//===============================
//WIFI模块连接指定WIFI
bit ATWifi(u8* username,u8* password);

//连接TCP服务器
bit TCPConnect(u8* address,u8* port);

//发送一个字符串
bit TCPSend(u8* message);

#endif